var store = [{
        "title": "spam-الرسائل-الدعائية",
        "excerpt":"نشر في جريدة الرياض الجمعه 12 صَفر 1428هـ – 2 مارس 2007م – العدد 14130 في عالم تقنية المعلومات تتسابق الشركات الدعائية لترويج منتجات الشركات الأخرى عبر البريد الالكتروني أو من خلال تصفحك لمواقع الإنترنت أو من خلال إعلانات داخل البرامج التي نستخدمها. يطلق مسمى السبام على تلك المواد الإعلانية...","categories": ["ar_posts"],
        "tags": ["الرسائل-الدعائية","Spam"],
        "url": "http://localhost:4000/ar_posts/spam/",
        "teaser":null},{
        "title": "مستخدمو الإنترنت في أمريكا الشمالية يكسبون عشرة آلاف دولار شهرياً من المزادات الإلكترونية",
        "excerpt":"نشر في جريدة الرياض الجمعه 19 ربيع الآخر 1429هـ – 25أبريل 2008م – العدد 14550 العديد من مستخدمي الإنترنت في أمريكا وكندا يتجهون إلى إيجاد مدخولات شهرية عن طريق استخدام الإنترنت. الكثير منهم استبدل وظيفته والجلوس في مكتبه لساعات طويلة بالاتجار في المزادات الإلكترونية. لقد أصبحت المزادات الالكترونية وجهة جذابة...","categories": ["ar_posts"],
        "tags": ["الانترنت","المزادات الالكترونية","Online Auction"],
        "url": "http://localhost:4000/ar_posts/online_auction/",
        "teaser":null},{
        "title": "الجيل القادم من المواقع",
        "excerpt":"لقد شهدت الشبكة العنكبوتية منذ انطلاقتها ثورة هائلة في مواقع الانترنت وصفحات الويب من حيث المحتوى والاستخدام. لقد رمز للجيل الأول من المواقع والذي اعتمد على عرض مواقع ذات محتوى ثابت وغير متغير بشكل سريع معتمدين على النشر من طرف واحد وأعني به صاحب الموقع. فلم تكن التقنية في هذا...","categories": ["ar_posts"],
        "tags": ["التقنية","الحياة الاجتماعية"],
        "url": "http://localhost:4000/ar_posts/nextGenerationWeb/",
        "teaser":null},{
        "title": "الشراء بالبطاقات الائتمانية",
        "excerpt":"نشر في جريدة الرياض الجمعه 26 محرم 1430هـ – 23 يناير2009م – العدد 14823 تعد التجارة الإلكترونية الجاذب الأهم للعديد من الشركات والجهات الربحية للاستفادة من الخدمات الإلكترونية لتوسيع رقعة مصادر الدخل. وهذه الأهداف المساهمة في ذلك ، يستأنس منها المستخدمون كونها تسهل عمليات البيع والشراء وتفتح مجالأ واسعاً للمنافسة...","categories": ["ar_posts"],
        "tags": ["الرسائل-الدعائية","Spam"],
        "url": "http://localhost:4000/ar_posts/payments/",
        "teaser":null},{
        "title": "الجيل القادم من المواقع",
        "excerpt":"لقد شهدت الشبكة العنكبوتية منذ انطلاقتها ثورة هائلة في مواقع الانترنت وصفحات الويب من حيث المحتوى والاستخدام. لقد رمز للجيل الأول من المواقع والذي اعتمد على عرض مواقع ذات محتوى ثابت وغير متغير بشكل سريع معتمدين على النشر من طرف واحد وأعني به صاحب الموقع. فلم تكن التقنية في هذا...","categories": ["ar_posts"],
        "tags": [],
        "url": "http://localhost:4000/ar_posts/Soci_tech/",
        "teaser":null},{
        "title": "الأشياء التي حولنا ستتحدث معنا",
        "excerpt":"في المعجم، الكلام من المخاطبة، والمخاطبة التوجه بكلام يتضمن معنى، وأنت أيها القارئ الكريم ستتحدث مع أجهزة منزلك كالثلاجة والفرن المنزلي قريباً. هكذا يبدو العالم الرقمي اليوم منهمكاً في جعل الجمادات مفيدة يتحدث المرء معها بتوجه خطابٍ مفهوم إما على صيغة أمر أو على سبيل المساعدة. هذا السرد المبسط يطلق...","categories": ["ar_posts"],
        "tags": ["انترنت الأشياء","البيانات"],
        "url": "http://localhost:4000/ar_posts/ar_iot/",
        "teaser":null},{
        "title": "السياق .. مستقبل التقنية",
        "excerpt":"السياق لغة الموقف الذي يشار للدلالة عليه مجموعة من العلاقات الزمنية والمكانية المتصلة وهو أيضاً يعني سياق الكلام الذي يصف حالة ما. وفي لغة التقنية، السياق يعني الظروف المحيطة بالفكرة أو الحادثة. ربما طرح مثال يوضح المعنى أكثر ولماذا قد يكون السياق أحد مفاتيح المستقبل. لتتخيل أيها القارئ الكريم أن...","categories": ["ar_posts"],
        "tags": ["التقنية","السياق"],
        "url": "http://localhost:4000/ar_posts/ar_context/",
        "teaser":null},{
        "title": "ماذا ينقصنا اليوم تقنياً؟",
        "excerpt":"نشر في جريدة الرياض . الأربعاء 2 ذي الحجة 1436 هـ - 16 سبتمبر 2015م - العدد 17250, صفحة رقم ( 34 ) تتسارع الأدوات والحلول التقنية اليوم في اتجاهات مختلفة، منها ما يخدم في زيادة الرفاهية لمعيشتنا والآخر ما يساهم في زيادة مستوى التواصل الاجتماعي أو الإنتاج الصناعي. ولذلك...","categories": ["ar_posts"],
        "tags": ["الذكاء-الاصطناعي","مستقبل-التقنية"],
        "url": "http://localhost:4000/ar_posts/ar_whatsmissing/",
        "teaser":null},{
        "title": "تسارع شبكات التواصل الاجتماعية",
        "excerpt":"نشر في جريدة الرياض الثلاثاء 22 ذي الحجة 1436 هـ - 6 اكتوبر 2015 م - العدد 17270, صفحة رقم ( 26 ) ذكر ابن خلدون في مقدمته أن الاجتماع الإنساني ضروري، وأنه مدني بطبعه، واجتماعهم من ضروريات فطرته، وهذا المنطق يتناسق بانتظام في تفسير انتشار شبكات التواصل الاجتماعي اليوم...","categories": ["ar_posts"],
        "tags": ["الشبكات-الاجتماعية","التواصل-الاجتماعي"],
        "url": "http://localhost:4000/ar_posts/ar_socialmedia/",
        "teaser":null},{
        "title": "اقتصاد الشبكات الاجتماعية",
        "excerpt":"نشر في جريدة الرياض الاثنين 28 ذي الحجة 1436 هـ – 12 اكتوبر 2015 م – العدد 17276, صفحة رقم ( 26 ) ذكرت في مقالي السابق المنشور بتاريخ 22 ذي الحجة 1436 ه ، مدى تسارع انتشار شبكات التواصل الاجتماعي في فضاء الإنترنت والقيمة الاقتصادية التي حققتها تلك الشبكات...","categories": ["ar_posts"],
        "tags": ["الشبكات-الاجتماعية","اقتصاد-الشبكات-الاجتماعية"],
        "url": "http://localhost:4000/ar_posts/ar_socialeco/",
        "teaser":null},{
        "title": "بوصلة المدن الذكية",
        "excerpt":"نشر في جريدة الرياض ، العدد ١٧٢٩٣ الخميس ١٦ محرم ١٤٣٧ ه الموافق ٢٩ أكتوبر ٢٠١٥ م. تتعدد وجهات النظر حول مفهوم المدن الذكية وتختلف صورها في أذهاننا، ليس فقط بين العامة منا بل أيضاً بين المختصين. من المؤكد أن المدن الذكية تقوم على قائمة من الأمنيات التي يراد تحقيقها...","categories": ["ar_posts"],
        "tags": ["المدن-الذكية","مستقبل-المدن"],
        "url": "http://localhost:4000/ar_posts/ar_smartCities/",
        "teaser":null},{
        "title": "التقنية و مطارات المستقبل",
        "excerpt":"نشر في جريدة الرياض السبت 2 صفر 1437 هـ - 14 نوفمبر 2015م - العدد 17309 , صفحة رقم ( 22) المطارات بوابات الدول ومنها يعبر أغلب البشر في انتقالهم وتعد وسيلة مهمة ليست فقط في تسهيل إجراءات عبور المسافرين بل أيضاً وسيلة للدلالة على المستوى الخدمي والاقتصادي ومرآة تعكس...","categories": ["ar_posts"],
        "tags": ["الطائرات","مستقبل-المطارات","تقنيات-المطارات"],
        "url": "http://localhost:4000/ar_posts/ar_airportstech/",
        "teaser":null},{
        "title": "التقنية داخل الطائرة",
        "excerpt":"نشر في جريدة الرياض - الاثنين 25 صفر 1437 هـ - 07 ديسمبر 2015م - العدد 17332 , صفحة رقم ( 30 ) ذكرت في مقالي السابق المنشور بتاريخ 2 صفر 1437 ه، تصورات بشأن الدور الذي تستطيع التقنية أن تلعبه لتطوير مطارات العالم في المستقبل القريب والقيمة الاقتصادية العائدة...","categories": ["ar_posts"],
        "tags": ["المدن-الذكية","مستقبل-المدن"],
        "url": "http://localhost:4000/ar_posts/ar_airplanes/",
        "teaser":null},{
        "title": "التحول لاقتصاد المعرفة",
        "excerpt":"السبت 6 ربيع الأخر 1437 هـ - 16 يناير 2016م - العدد 17372, صفحة رقم ( 35 ) يشهد عهد خادم الحرمين الملك سلمان بن عبدالعزيز -حفظه الله- عزماً قوياً على المضي في تنوع مصادر الدخل والاستثمار في بناء اقتصاد المعرفة لخلق المزيد من فرص العمل والاستمرار في دعم الازدهار...","categories": ["ar_posts"],
        "tags": ["اقتصاد-المعرفة","التحول-الرقمي"],
        "url": "http://localhost:4000/ar_posts/ar_ecoknow/",
        "teaser":null},{
        "title": "الأوراق المالية الإلكترونية",
        "excerpt":"الأربعاء 1 جمادى الأولى 1437 هـ - 10 فبراير 2016م - العدد 17397 , صفحة رقم ( 22 ) يعتمد البشر على الأوراق النقدية في معاملاتهم التجارية، فقد كان الصينيون أول من ابتكر التعامل بالورق النقدي بين عامي 618 و900 للميلاد. وفي القرن السابع عشر، بدأ الأوروبيون بتبادل الأوراق النقدية...","categories": ["ar_posts"],
        "tags": ["الأوراق-المالية","العملة-الرقمية"],
        "url": "http://localhost:4000/ar_posts/ar_emoney/",
        "teaser":null},{
        "title": "رؤية المملكة والاستثمار في البيانات",
        "excerpt":"السبت 13 رمضان 1437 هـ- 18 يونيو 2016م - العدد 1512314 سهلت التقنية التي نمتلكها اليوم في جمع ثروة كبيرة من البيانات التي تتفاقم قيمتها وأهميتها يوماً بعد يوم. الكثير من الأشياء التي طرأت مؤخراً في مجال البرمجيات ووسائل التواصل الاجتماعي غيرت الكثير من المفاهيم الهندسية للأنظمة وطرق التعامل مع...","categories": ["ar_posts"],
        "tags": ["رؤية-المملكة","الاستثمار-في-البيانات"],
        "url": "http://localhost:4000/ar_posts/ar_techvision/",
        "teaser":null},{
        "title": "القوة الدافعة للاستثمار في المعلوماتية",
        "excerpt":"نشر في جريدة الرياض - الاثنين 25 صفر 1438 هـ - 21 ديسمبر 2016م - العدد 1550169 , صفحة رقم ( 30 ) العالم اليوم يتسارع في التغير اقتصادياً. العديد من الدول النامية غدت تنصرف عن الاعتماد على الثروات الطبيعية متجهة إلى الصناعات المتخصصة معتمدة في ذلك على الخبرات المحلية...","categories": ["ar_posts"],
        "tags": ["الاستثمار-في-المعلوماتية","الاستثمار-في-البيانات"],
        "url": "http://localhost:4000/ar_posts/ar_techinvest/",
        "teaser":null},{
        "title": "Features Engineering in ML",
        "excerpt":"Look at the sites you frequent and take note of their readability. Inspect their CSS of your favorites: Right-click &gt; Inspect Element on the paragraph you like and steal their font-size, line-height, and paragraph width. Welcome I recently spent some time improving the typography of this blog. Here are the...","categories": [],
        "tags": ["Machine Learning","ML","Feature Engineering","AI"],
        "url": "http://localhost:4000/feature_engineering/",
        "teaser":"http://localhost:4000/assets/images/ai-icon.jpg"}]
