var store = [{
        "title": "الجيل القادم من المواقع",
        "excerpt":"لقد شهدت الشبكة العنكبوتية منذ انطلاقتها ثورة هائلة في مواقع الانترنت وصفحات الويب من حيث المحتوى والاستخدام. لقد رمز للجيل الأول من المواقع والذي اعتمد على عرض مواقع ذات محتوى ثابت وغير متغير بشكل سريع معتمدين على النشر من طرف واحد وأعني به صاحب الموقع. فلم تكن التقنية في هذا...","categories": ["ar_posts"],
        "tags": ["التقنية","الحياة الاجتماعية"],
        "url": "http://localhost:4000/ar_posts/nextGenerationWeb/",
        "teaser":null},{
        "title": "الجيل القادم من المواقع",
        "excerpt":"Photo by Jacqueline Kelly on Unsplash لقد شهدت الشبكة العنكبوتية منذ انطلاقتها ثورة هائلة في مواقع الانترنت وصفحات الويب من حيث المحتوى والاستخدام. لقد رمز للجيل الأول من المواقع والذي اعتمد على عرض مواقع ذات محتوى ثابت وغير متغير بشكل سريع معتمدين على النشر من طرف واحد وأعني به صاحب...","categories": ["ar_posts"],
        "tags": [],
        "url": "http://localhost:4000/ar_posts/Soci_tech/",
        "teaser":"http://localhost:4000/assets/images/111-icon.jpg"},{
        "title": "الأشياء التي حولنا ستتحدث معنا",
        "excerpt":"Photo by BENCE BOROS on Unsplash في المعجم، الكلام من المخاطبة، والمخاطبة التوجه بكلام يتضمن معنى، وأنت أيها القارئ الكريم ستتحدث مع أجهزة منزلك كالثلاجة والفرن المنزلي قريباً. هكذا يبدو العالم الرقمي اليوم منهمكاً في جعل الجمادات مفيدة يتحدث المرء معها بتوجه خطابٍ مفهوم إما على صيغة أمر أو على...","categories": ["ar_posts"],
        "tags": ["انترنت الأشياء","البيانات"],
        "url": "http://localhost:4000/ar_posts/ar_iot/",
        "teaser":"http://localhost:4000/assets/images/110-icon.jpg"},{
        "title": "السياق .. مستقبل التقنية",
        "excerpt":"Photo by mohammad takhsh on Unsplash السياق لغة الموقف الذي يشار للدلالة عليه مجموعة من العلاقات الزمنية والمكانية المتصلة وهو أيضاً يعني سياق الكلام الذي يصف حالة ما. وفي لغة التقنية، السياق يعني الظروف المحيطة بالفكرة أو الحادثة. ربما طرح مثال يوضح المعنى أكثر ولماذا قد يكون السياق أحد مفاتيح...","categories": ["ar_posts"],
        "tags": ["التقنية","السياق"],
        "url": "http://localhost:4000/ar_posts/ar_context/",
        "teaser":"http://localhost:4000/assets/images/109-icon.jpg"},{
        "title": "مستقبل الإنترنت",
        "excerpt":"Photo by Nathan Hobbs on Unsplash الاثنين 16 ذي القعدة 1436 هـ - 31 اغسطس 2015م - العدد 17234, صفحة رقم ( 26 ) قد يتساءل أحد منا عما سيفضي ويتطور إليه عالم الإنترنت في المستقبل وماذا سيؤثر ذلك على حياتنا. تعود بدايات فكرة الإنترنت إلى ملاحظات وأفكار كتبها تيم...","categories": ["ar_posts"],
        "tags": ["مستقبل-الانترنت","عالم-الانترنت"],
        "url": "http://localhost:4000/ar_posts/internetfuture/",
        "teaser":"http://localhost:4000/assets/images/108-icon.jpg"},{
        "title": "ماذا ينقصنا اليوم تقنياً؟",
        "excerpt":"Photo by Nathan Hobbs on Unsplash نشر في جريدة الرياض . الأربعاء 2 ذي الحجة 1436 هـ - 16 سبتمبر 2015م - العدد 17250, صفحة رقم ( 34 ) تتسارع الأدوات والحلول التقنية اليوم في اتجاهات مختلفة، منها ما يخدم في زيادة الرفاهية لمعيشتنا والآخر ما يساهم في زيادة مستوى...","categories": ["ar_posts"],
        "tags": ["الذكاء-الاصطناعي","مستقبل-التقنية"],
        "url": "http://localhost:4000/ar_posts/ar_whatsmissing/",
        "teaser":"http://localhost:4000/assets/images/107-icon.jpg"},{
        "title": "تسارع شبكات التواصل الاجتماعية",
        "excerpt":"Photo by Austin Distel on Unsplash نشر في جريدة الرياض الثلاثاء 22 ذي الحجة 1436 هـ - 6 اكتوبر 2015 م - العدد 17270, صفحة رقم ( 26 ) ذكر ابن خلدون في مقدمته أن الاجتماع الإنساني ضروري، وأنه مدني بطبعه، واجتماعهم من ضروريات فطرته، وهذا المنطق يتناسق بانتظام في...","categories": ["ar_posts"],
        "tags": ["الشبكات-الاجتماعية","التواصل-الاجتماعي"],
        "url": "http://localhost:4000/ar_posts/ar_socialmedia/",
        "teaser":"http://localhost:4000/assets/images/106-icon.jpg"},{
        "title": "اقتصاد الشبكات الاجتماعية",
        "excerpt":"Photo by Hugh Han on Unsplash نشر في جريدة الرياض الاثنين 28 ذي الحجة 1436 هـ – 12 اكتوبر 2015 م – العدد 17276, صفحة رقم ( 26 ) ذكرت في مقالي السابق المنشور بتاريخ 22 ذي الحجة 1436 ه ، مدى تسارع انتشار شبكات التواصل الاجتماعي في فضاء الإنترنت...","categories": ["ar_posts"],
        "tags": ["الشبكات-الاجتماعية","اقتصاد-الشبكات-الاجتماعية"],
        "url": "http://localhost:4000/ar_posts/ar_socialeco/",
        "teaser":"http://localhost:4000/assets/images/105-icon.jpg"},{
        "title": "بوصلة المدن الذكية",
        "excerpt":"Photo by Nathan Hobbs on Unsplash نشر في جريدة الرياض ، العدد ١٧٢٩٣ الخميس ١٦ محرم ١٤٣٧ ه الموافق ٢٩ أكتوبر ٢٠١٥ م. تتعدد وجهات النظر حول مفهوم المدن الذكية وتختلف صورها في أذهاننا، ليس فقط بين العامة منا بل أيضاً بين المختصين. من المؤكد أن المدن الذكية تقوم على...","categories": ["ar_posts"],
        "tags": ["المدن-الذكية","مستقبل-المدن"],
        "url": "http://localhost:4000/ar_posts/ar_smartCities/",
        "teaser":"http://localhost:4000/assets/images/104-icon.jpg"},{
        "title": "التقنية و مطارات المستقبل",
        "excerpt":"Photo by Nathan Hobbs on Unsplash نشر في جريدة الرياض السبت 2 صفر 1437 هـ - 14 نوفمبر 2015م - العدد 17309 , صفحة رقم ( 22) المطارات بوابات الدول ومنها يعبر أغلب البشر في انتقالهم وتعد وسيلة مهمة ليست فقط في تسهيل إجراءات عبور المسافرين بل أيضاً وسيلة للدلالة...","categories": ["ar_posts"],
        "tags": ["الطائرات","مستقبل-المطارات","تقنيات-المطارات"],
        "url": "http://localhost:4000/ar_posts/ar_airportstech/",
        "teaser":"http://localhost:4000/assets/images/103-icon.jpg"},{
        "title": "التقنية داخل الطائرة",
        "excerpt":"Photo by Nathan Hobbs on Unsplash نشر في جريدة الرياض - الاثنين 25 صفر 1437 هـ - 07 ديسمبر 2015م - العدد 17332 , صفحة رقم ( 30 ) ذكرت في مقالي السابق المنشور بتاريخ 2 صفر 1437 ه، تصورات بشأن الدور الذي تستطيع التقنية أن تلعبه لتطوير مطارات العالم...","categories": ["ar_posts"],
        "tags": ["المدن-الذكية","مستقبل-المدن"],
        "url": "http://localhost:4000/ar_posts/ar_airplanes/",
        "teaser":"http://localhost:4000/assets/images/102-icon.jpg"},{
        "title": "التحول لاقتصاد المعرفة",
        "excerpt":"Photo by Austin Distel on Unsplash. السبت 6 ربيع الأخر 1437 هـ - 16 يناير 2016م - العدد 17372, صفحة رقم ( 35 ) يشهد عهد خادم الحرمين الملك سلمان بن عبدالعزيز -حفظه الله- عزماً قوياً على المضي في تنوع مصادر الدخل والاستثمار في بناء اقتصاد المعرفة لخلق المزيد من...","categories": ["ar_posts"],
        "tags": ["اقتصاد-المعرفة","التحول-الرقمي"],
        "url": "http://localhost:4000/ar_posts/ar_ecoknow/",
        "teaser":"http://localhost:4000/assets/images/101-icon.jpg"},{
        "title": "الأوراق المالية الإلكترونية",
        "excerpt":"Photo by Austin Distel on Unsplash. الأربعاء 1 جمادى الأولى 1437 هـ - 10 فبراير 2016م - العدد 17397 , صفحة رقم ( 22 ) يعتمد البشر على الأوراق النقدية في معاملاتهم التجارية، فقد كان الصينيون أول من ابتكر التعامل بالورق النقدي بين عامي 618 و900 للميلاد. وفي القرن السابع...","categories": ["ar_posts"],
        "tags": ["الأوراق-المالية","العملة-الرقمية"],
        "url": "http://localhost:4000/ar_posts/ar_emoney/",
        "teaser":"http://localhost:4000/assets/images/100-icon.jpg"},{
        "title": "رؤية المملكة والاستثمار في البيانات",
        "excerpt":"Photo by NASA on Unsplash السبت 13 رمضان 1437 هـ- 18 يونيو 2016م - العدد 1512314 سهلت التقنية التي نمتلكها اليوم في جمع ثروة كبيرة من البيانات التي تتفاقم قيمتها وأهميتها يوماً بعد يوم. الكثير من الأشياء التي طرأت مؤخراً في مجال البرمجيات ووسائل التواصل الاجتماعي غيرت الكثير من المفاهيم...","categories": ["ar_posts"],
        "tags": ["رؤية-المملكة","الاستثمار-في-البيانات"],
        "url": "http://localhost:4000/ar_posts/ar_techvision/",
        "teaser":"http://localhost:4000/assets/images/invest-tech-icon.jpg"},{
        "title": "القوة الدافعة للاستثمار في المعلوماتية",
        "excerpt":"Photo by Austin Distel on Unsplash. نشر في جريدة الرياض - الاثنين 25 صفر 1438 هـ - 21 ديسمبر 2016م - العدد 1550169 , صفحة رقم ( 30 ) العالم اليوم يتسارع في التغير اقتصادياً. العديد من الدول النامية غدت تنصرف عن الاعتماد على الثروات الطبيعية متجهة إلى الصناعات المتخصصة...","categories": ["ar_posts"],
        "tags": ["الاستثمار-في-المعلوماتية","الاستثمار-في-البيانات"],
        "url": "http://localhost:4000/ar_posts/ar_techinvest/",
        "teaser":"http://localhost:4000/assets/images/invest-icon.jpg"},{
        "title": "الكتب، الدورات، وقواعد البيانات التي يجب على كل عالم بيانات معرفتها",
        "excerpt":"نشر في موقع نمذجيات - ٧ ديسمبر 2019م بادئ ذي بدء، أنت على الطريق الصحيح. يعد العمل على تعلم الآلة (Machine Learning) من أجل بناء معرفتك في مجال الذكاء الاصطناعي خياراً مميزاً. تحرز تقنيات الذكاء الاصطناعي تقدماً هائلاً ليس فقط في تطوير البرمجيات بل كل جانب من جوانب حياتنا اليومية....","categories": ["ar_posts"],
        "tags": ["كتب-في-تعلم-الآلة","مراجع-في-تعلم-الآلة"],
        "url": "http://localhost:4000/ar_posts/ar_ml_resources/",
        "teaser":"https://i0.wp.com/miro.medium.com/max/1514/1*kzdg0w1TOhqAoxpLoWFVNA.png?zoom=2&resize=708%2C396&ssl=1"},{
        "title": "ترميز النصوص: مراجعة",
        "excerpt":"نشر في موقع نمذجيات - ٢٧ يناير ٢٠٢٠ م العامل الرئيس لتنفيذ أي عملية لاستخراج النص، مثل اكتشاف الموضوع أو تحليل المشاعر، هو تحويل الكلمات إلى أرقام، وتحويل سلسلة الكلمات إلى تسلسل رقمي. بمجرد حصولنا على الأرقام، نعود إلى لعبة تحليل البيانات المعروفة، حيث يمكن أن تساعدنا خوارزميات تعلم الآلة...","categories": ["ar_posts"],
        "tags": ["تعلم-الآلة","الترميز-في-تعلم-الآلة"],
        "url": "http://localhost:4000/ar_posts/ar_encoding/",
        "teaser":"https://i0.wp.com/www.nmthgiat.com/wp-content/uploads/2020/01/white-printing-paper-with-numbers.jpg?zoom=2&resize=768%2C399&ssl=1"},{
        "title": "أهم عشرة أخطاء إحصائية يرتكبها علماء البيانات",
        "excerpt":"نشر في موقع نمذجيات - ١ فبراير ٢٠٢٠ م عالم البيانات هو “شخص أفضل في الإحصاء من أي مهندس برمجيات وأفضل في هندسة البرمجيات من أي إحصائي”. في مقالة سابقة: أهم عشرة أخطاء برمجية قام بها علماء البيانات، ناقشنا كيف يمكن للإحصائيين أن يصبحوا مُبرمجين بشكل أفضل. نناقش هنا كيف...","categories": ["ar_posts"],
        "tags": ["تعلم-الآلة","أخطاء-في-تعلم-الآلة"],
        "url": "http://localhost:4000/ar_posts/ar_ml_mistakes/",
        "teaser":"https://i0.wp.com/www.nmthgiat.com/wp-content/uploads/2020/02/mitsakes.jpg?zoom=2&resize=768%2C295&ssl=1"},{
        "title": "<div class=\"col-md-6 text-right\">فهم الاختلافات بين مكتبتي لغة بايثون NumPy و Numba</div>",
        "excerpt":"Photo by Patrick Tomasso on Unsplash NumPy و Numba هما حزمتان رائعتان متاحتان بلغة بايثون لإجراء عمليات على المصفوفات. كلاهما يعملان بكفاءة على مصفوفات متعددة الأبعاد. في لغة بايثون، تحمل طريقة بناء المتجهات طبيعة ديناميكية. سيؤدي إلحاق قيم جديدة بالمصفوفة إلى زيادة حجم المصفوفة تلقائياً. تعمل مصفوفات NumPy بشكل مختلف...","categories": [],
        "tags": [],
        "url": "http://localhost:4000/numpy_vs_numba/",
        "teaser":null},{
        "title": "<div class=\"col-md-6 text-right\">تعلم الآلة ‫-‬ أساليب أخذ العينات</div>",
        "excerpt":"Photo by Luke Chesser on Unsplash لطالما ارتبط مفهوم العينات بالعملية البحثية التي تتطلب اختبار صحة أو قبول فرضيات يتعذر اختبارها على شريحة واسعة أو باستخدام أمثلة غزيرة. في تعلم الآلة، سرعان ما نقفز للسؤال عن ماهية البيانات المستخدمة وأحجام توفرها. ستسلط هذه المقالة على الحالات التي نلجأ فيها عند...","categories": [],
        "tags": [],
        "url": "http://localhost:4000/data_sampling/",
        "teaser":null},{
        "title": "<div class=\"col-md-6 text-right\">مقدمة في ترميز النصوص</div>",
        "excerpt":"كما هو من البديهي، فإن الآلة لا تتعامل مع النصوص بحروفها وأفعالها وأسمائها وأنه يتوجب علينا تحويل هذه النصوص لمعاملات رقمية يمكن للآلة أن تبني خوارزمياتها عليها. بناءً على ذلك، كيف للآلة أن تتعلم أن نصاً معيناً يحمل صفةً إيجابية مثلاً أو سلبية؟ كيف لمحركات البحث أن تفهم عن ماذا...","categories": [],
        "tags": [],
        "url": "http://localhost:4000/into_text_encoding/",
        "teaser":null}]
